categories=[
                        {gen1: "レディース", gen1_children:[
                                                            {gen2: "トップス",gen2_children[
                                                              "すべて", "Tシャツ/カットソー(半袖/袖なし)", "Tシャツ/カットソー(七分/長袖)", "シャツ/ブラウス(半袖/袖なし)", "シャツ/ブラウス(七分/長袖)", "ポロシャツ", "キャミソール", "タンクトップ", "ホルターネック", "ニット/セーター", "チュニック", "カーディガン/ボレロ", "アンサンブル", "ベスト/ジレ", "パーカー", "トレーナー/スウェット", "ベアトップ/チューブトップ", "ジャージ", "その他"
                                                            ]},
                                                            {gen2: "ジャケット/アウター", gen2_children[
                                                              "すべて", "テーラードジャケット", "ノーカラージャケット", "Gジャン/デニムジャケット", "レザージャケット", "ダウンジャケット", "ライダースジャケット", "ミリタリージャケット", "ダウンベスト", "ジャンパー/ブルゾン", "ポンチョ", "ロングコート", "トレンチコート", "ダッフルコート", "ピーコート", "チェスターコート", "モッズコート", "スタジャン", "毛皮/ファーコート", "スプリングコート", "スカジャン", "その他"
                                                            ]},
                                                            {gen2: "パンツ", gen2_children[
                                                              "すべて", "デニム/ジーンズ", "ショートパンツ", "カジュアルパンツ", "ハーフパンツ", "チノパン", "ワークパンツ/カーゴパンツ", "クロップドパンツ", "サロペット/オーバーオール", "オールインワン", "サルエルパンツ", "ガウチョパンツ", "その他"
                                                            ]},
                                                            {gen2: "スカート", gen2_children[
                                                              "すべて", "ミニスカート", "ひざ丈スカート", "ロングスカート", "キュロット", "その他"
                                                            ]},
                                                            {gen2: "ワンピース", gen2_children[
                                                              "すべて", "ミニワンピース", "ひざ丈ワンピース", "ロングワンピース", "その他"
                                                            ]},
                                                            {gen2: "靴", gen2_children[
                                                              "すべて", "ハイヒール/パンプス", "ブーツ", "サンダル", "スニーカー", "ミュール", "モカシン", "ローファー/革靴", "フラットシューズ/バレエシューズ", "長靴/レインシューズ", "その他"
                                                            ]},
                                                            {gen2: "ルームウェア/パジャマ", gen2_children[
                                                              "すべて", "パジャマ", "ルームウェア"
                                                            ]},
                                                            {gen2: "レッグウェア", gen2_children[
                                                              "すべて", "ソックス", "スパッツ/レギンス", "ストッキング/タイツ", "レッグウォーマー", "その他"
                                                            ]},
                                                            {gen2: "帽子", gen2_children[
                                                              "すべて", "ニットキャップ/ビーニー", "ハット", "ハンチング/ベレー帽", "キャップ", "キャスケット", "麦わら帽子", "その他"
                                                            ]},
                                                            {gen2: "バッグ", gen2_children[
                                                              "すべて", "ハンドバッグ", "トートバッグ", "エコバッグ", "リュック/バックパック", "ショルダーバッグ", "クラッチバッグ", "ポーチ/バニティ", "ボディバッグ/ウェストバッグ", "バザーズバッグ", "メッセンジャーバッグ", "ビジネスバッグ", "旅行者バッグ/キャリーバッグ", "ショップ袋", "和装用バッグ", "かごバッグ", "その他"
                                                            ]},
                                                            {gen2: "アクセサリー", gen2_children[
                                                              "すべて", "ネックレス", "ブレスレット", "バングル/リストバンド", "リング", "ピアス(片耳用)", "ピアス(両耳用)", "イヤリング", "アンクレット", "ブローチ/コサージュ", "チャーム", "その他"
                                                            ]},
                                                            {gen2: "ヘアアクセサリー", gen2_children[
                                                              "すべて", "ヘアゴム/シュシュ", "ヘアバンド/カチューシャ", "ヘアピン", "その他"
                                                            ]},
                                                            {gen2: "小物", gen2_children[
                                                              "すべて", "長財布", "折り財布", "コインケース/小銭入れ", "名刺入れ/定期入れ", "キーケース", "キーホルダー", "手袋/アームカバー", "ハンカチ", "ベルト", "マフラー/ショール", "ストール/スヌード", "サスペンダー", "サングラス/メガネ", "モバイルケース/カバー", "手帳", "イヤマフラー", "傘", "レインコート/ポンチョ", "ミラー", "タバコグッズ", "その他"
                                                            ]},
                                                            {gen2: "時計", gen2_children[
                                                              "すべて", "腕時計(アナログ)", "腕時計(デジタル)", "ラバーベルト", "レザーベルト", "金属ベルト", "その他"
                                                            ]},
                                                            {gen2: "ウィッグ/エクステ", gen2_children[
                                                              "すべて", "前髪ウィッグ", "ロングスカート", "ロングカール", "ショートストレート", "ショートカール", "その他"
                                                            ]},
                                                            {gen2: "浴衣/水着", gen2_children[
                                                              "すべて", "浴衣", "着物", "振り袖", "長襦袢/半襦袢", "水着セパレート", "水着ワンピース", "水着スポーツ用", "その他"
                                                            ]},
                                                            {gen2: "スーツ/フォーマル/ドレス", gen2_children[
                                                              "すべて", "スカートスーツ上下", "パンツスーツ上下", "ドレス", "パーティーバッグ", "シューズ", "ウェディング", "その他"
                                                            ]},
                                                            {gen2: "マタニティ", gen2_children[
                                                              "すべて", "トップス", "アウター", "インナー", "ワンピース", "パンツ/スパッツ", "スカート", "パジャマ", "授乳服", "その他"
                                                            ]},
                                                            {gen2: "その他", gen2_children[
                                                              "すべて", "コスプレ", "下着", "その他"
                                                            ]}
                                                          ]},
                            {gen1: "メンズ", gen1_children:[
                                                            {gen2: "トップス", gen2_children[
                                                              "すべて", "Tシャツ/カットソー(半袖/袖なし)", "Tシャツ/カットソー(七分/長袖)", "シャツ", "ポロシャツ", "タンクトップ", "ニット/セーター", "パーカー", "カーディガン", "スウェット", "ジャージ", "ベスト", "その他"
                                                            ]},
                                                            {gen2: "ジャケット/アウター", gen2_children[
                                                              "すべて", "テーラードジャケット", "ノーカラージャケット", "Gジャン/デニムジャケット", "レザージャケット", "ダウンジャケット", "ライダースジャケット", "ミリタリージャケット", "ナイロンジャケット", "フライトジャケット", "ダッフルコート", "ピーコート", "ステンカラーコート", "トレンチコート", "モッズコート", "チェスターコート", "スタジャン", "スカジャン", "ブルゾン", "マウンテンパーカー", "ダウンベスト", "ポンチョ", "カバーオール", "その他"
                                                            ]},
                                                            {gen2: "パンツ", gen2_children[
                                                              "すべて", "デニム/ジーンズ", "ワークパンツ/カーゴパンツ", "スラックス", "チノパン", "ショートパンツ", "ペインターパンツ", "サルエルパンツ", "オーバーオール", "その他"
                                                            ]},
                                                            {gen2: "靴", gen2_children[
                                                              "すべて", "スニーカー", "サンダル", "ブーツ", "モカシン", "ドレス/ビジネス", "長靴/レインシューズ", "デッキシューズ", "その他"
                                                            ]},
                                                            {gen2: "バッグ", gen2_children[
                                                              "すべて", "ショルダーバッグ", "トートバッグ", "ボストンバッグ", "リュック/バックパック", "ウエストポーチ", "ボディーバッグ", "ドラムバッグ", "ビジネスバッグ", "トラベルバッグ", "メッセンジャーバッグ", "エコバッグ", "その他"
                                                            ]},
                                                            {gen2: "スーツ", gen2_children[
                                                              "すべて", "スーツジャケット", "スーツベスト", "スラックス", "セットアップ", "その他"
                                                            ]},
                                                            {gen2: "帽子", gen2_children[
                                                              "すべて", "キャップ", "ハット", "ニットキャップ/ビーニー", "ハンチング/ベレー帽", "キャスケット", "サンバイザー", "その他"
                                                            ]},
                                                            {gen2: "アクセサリー", gen2_children[
                                                              "すべて", "ネックレス", "ブレスレット", "バングル/リストバンド", "リング", "ピアス(片耳用)", "ピアス(両耳用)", "アンクレット", "その他"
                                                            ]},
                                                            {gen2: "小物", gen2_children[
                                                              "すべて", "長財布", "折り財布", "マネークリップ", "コインケース/小銭ケース", "名刺入れ/定期入れ", "キーケース", "キーホルダー", "ネクタイ", "手袋", "ハンカチ", "ベルト", "マフラー", "ストール", "バンダナ", "ネックウォーマー", "サスペンダー", "ウォレットチェーン", "サングラス/メガネ", "モバイルケース/カバー", "手帳", "ストラップ", "ネクタイピン", "カフリンクス", "イヤマフラー", "傘", "レインコート", "ミラー", "タバコグッズ", "その他"
                                                            ]},
                                                            {gen2: "時計", gen2_children[
                                                              "すべて", "腕時計(アナログ)", "腕時計(デジタル)", "ラバーベルト", "レザーベルト", "金属ベルト", "その他"
                                                            ]},
                                                            {gen2: "水着", gen2_children[
                                                              "すべて", "一般水着", "スポーツ用", "アクセサリー", "その他"
                                                            ]},
                                                            {gen2: "レッグウェア", gen2_children[
                                                              "すべて", "ソックス", "レギンス/スパッツ", "レッグウォーマー", "その他"
                                                            ]},
                                                            {gen2: "アンダーウェア", gen2_children[
                                                              "すべて", "トランクス", "ボクサーパンツ", "その他"
                                                            ]},
                                                            {gen2: "その他", gen2_children[
                                                              "すべて"
                                                            ]}
                                                          ]},
                    {gen1: "ベビー・キッズ", gen1_children: [
                                                            {gen2: "ベビー服(女の子用) ~95cm", gen2_children[
                                                              "すべて", "トップス", "アウター", "パンツ", "スカート", "ワンピース", "ベビードレス", "おくるみ", "下着/肌着", "パジャマ","ロンパース", "その他"
                                                            ]},
                                                            {gen2: "ベビー服(男の子用) ~95cm", gen2_children[
                                                              "すべて", "トップス", "アウター", "パンツ", "おくるみ", "下着/肌着", "パジャマ", "ロンパース", "その他"
                                                            ]},
                                                            {gen2: "ベビー服(男女兼用) ~95cm", gen2_children[
                                                              "すべて", "トップス", "アウター", "パンツ", "おくるみ", "下着/肌着", "パジャマ", "ロンパース", "その他"
                                                            ]},
                                                            {gen2: "キッズ服(女の子用) 100cm~", gen2_children[
                                                              "すべて", "コート", "ジャケット／上着", "トップス(Tシャツ/カットソー)", "トップス(トレーナー)", "トップス(チュニック)", "トップス(タンクトップ)", "トップス(その他)", "スカート", "パンツ", "ワンピース", "セットアップ", "パジャマ", "フォーマル/ドレス", "和服", "浴衣", "甚平", "水着", "その他"
                                                            ]},
                                                            {gen2: "キッズ服(男の子用) 100cm~", gen2_children[
                                                              "すべて", "コート", "ジャケット/上着", "トップス(Tシャツ/カットソー)", "トップス(トレーナー)", "トップス(その他)", "パンツ", "セットアップ", "パジャマ", "フォーマル/ドレス", "和服", "浴衣", "甚平", "水着", "その他"
                                                            ]},
                                                            {gen2: "キッズ服(男女兼用) 100cm~", gen2_children[
                                                              "すべて", "コート", "ジャケット/上着", "トップス(Tシャツ/カットソー)", "トップス(トレーナー)", "トップス(その他)", "ボトムス", "パジャマ", "その他"
                                                            ]},
                                                            {gen2: "キッズ靴", gen2_children[
                                                              "すべて", "スニーカー", "サンダル", "ブーツ", "長靴", "その他"
                                                            ]},
                                                            {gen2: "子ども用ファッション小物", gen2_children[
                                                              "すべて", "靴下/スパッツ", "帽子", "エプロン", "サスペンダー", "タイツ", "ハンカチ", "バンダナ", "ベルト", "マフラー", "傘", "手袋", "スタイ", "バッグ", "その他"
                                                            ]},
                                                            {gen2: "おむつ/トイレ/バス", gen2_children[
                                                              "すべて", "おむつ用品", "おまる/補助便座", "トレーニングパンツ", "ベビーバス", "お風呂用品", "その他"
                                                            ]},
                                                            {gen2: "外出/移動用品", gen2_children[
                                                              "すべて", "ベビーカー", "抱っこひも/スリング", "チャイルドシート", "その他"
                                                            ]},
                                                            {gen2: "授乳/食事", gen2_children[
                                                              "すべて", "ミルク", "ベビーフード", "ベビー用食器", "その他"
                                                            ]},
                                                            {gen2: "ベビー家具/寝具/室内用品", gen2_children[
                                                              "すべて", "ベッド", "布団/毛布", "イス", "たんす", "その他"
                                                            ]},
                                                            {gen2: "おもちゃ", gen2_children[
                                                              "すべて", "おふろのおもちゃ", "がらがら", "オルゴール", "ベビージム", "手押し車/カタカタ", "知育玩具", "その他"
                                                            ]},
                                                            {gen2: "行事/記念品", gen2_children[
                                                              "すべて", "お宮参り用品", "お食い初め用品", "アルバム", "手形/足型", "その他"
                                                            ]},
                                                            {gen2: "その他", gen2_children[
                                                              "すべて", "母子手帳用品", "その他"
                                                            ]}
                                                          ]},
            {gen1: "インテリア・住まい・小物", gen1_children: [
                                                            {gen2: "キッチン/食器", gen2_children[
                                                              "すべて", "食器", "調理器具", "収納/キッチン雑貨", "弁当用品", "カトラリー(スプーン等)", "テーブル用品", "容器", "エプロン", "アルコールグッズ", "浄水器", "その他"
                                                            ]},
                                                            {gen2: "ベッド/マットレス", gen2_children[
                                                              "すべて", "セミシングルベッド", "シングルベッド", "セミダブルベッド", "ダブルベッド", "ワイドダブルベッド", "クイーンベッド", "キングベッド", "脚付きマットレスベッド", "マットレス", "すのこベッド", "ロフトベッド/システムベッド", "簡易ベッド/折りたたみベッド", "収納付き", "その他"
                                                            ]},
                                                            {gen2: "ソファ/ソファベッド", gen2_children[
                                                              "すべて", "ソファセット", "シングルソファ", "ラブソファ", "トリプルソファ", "オットマン", "コーナーソファ", "ビーズソファ/クッションソファ", "ローソファ/フロアソファ", "ソファベッド", "応接セット", "ソファカバー", "リクライニングソファ", "その他"
                                                            ]},
                                                            {gen2: "椅子/チェア", gen2_children[
                                                              "すべて", "一般", "スツール", "ダイニングチェア", "ハイバックチェア", "ロッキングチェア", "座椅子", "折りたたみ椅子", "デスクチェア", "その他"
                                                            ]},
                                                            {gen2: "机/テーブル", gen2_children[
                                                              "すべて", "こたつ", "カウンターテーブル", "サイドテーブル", "センターテーブル", "ダイニングテーブル", "座卓/ちゃぶ台", "アウトドア用", "パソコン用", "事務机/学習机", "その他"
                                                            ]},
                                                            {gen2: "収納家具", gen2_children[
                                                              "すべて", "リビング収納", "キッチン収納", "玄関/屋外収納", "バス/トイレ収納", "本収納", "本/CD/DVD収納", "洋服ダンス/押入れ収納", "電話台/ファックス台", "ドレッサー/鏡台", "棚/ラック", "ケース/ボックス", "その他"
                                                            ]},
                                                            {gen2: "ラグ/カーペット/マット", gen2_children[
                                                              "すべて", "ラグ", "カーペット", "ホットカーペット", "玄関/キッチンマット", "トイレ/バスマット", "その他"
                                                            ]},
                                                            {gen2: "カーテン/ブラインド", gen2_children[
                                                              "すべて", "カーテン", "ブラインド", "ロールスクリーン", "のれん", "その他"
                                                            ]},
                                                            {gen2: "ライト/照明", gen2_children[
                                                              "すべて", "蛍光灯/電球", "天井照明", "フロアスタンド", "その他"
                                                            ]},
                                                            {gen2: "寝具", gen2_children[
                                                              "すべて", "布団/毛布", "枕", "シーツ/カバー", "その他"
                                                            ]},
                                                            {gen2: "インテリア/小物", gen2_children[
                                                              "すべて", "ゴミ箱", "ウェルカムボード", "オルゴール", "クッション", "クッションカバー", "スリッパラック", "ティッシュボックス", "バスケット/かご", "フォトフレーム", "マガジンラック", "モビール", "花瓶", "灰皿", "傘立て", "小物入れ", "置時計", "掛時計/柱時計", "鏡(立て掛け式)", "鏡(壁掛け式)", "置物", "風鈴", "植物/観葉植物", "その他"
                                                            ]},
                                                            {gen2: "季節/年中行事", gen2_children[
                                                              "すべて", "正月", "成人式", "バレンタインデー", "ひな祭り", "こどもの日", "母の日", "父の日", "サマーギフト/お中元", "夏/夏休み", "ハロウィン", "敬老の日", "七五三", "お歳暮", "クリスマス", "冬一般", "その他"
                                                            ]},
                                                            {gen2: "その他", gen2_children[
                                                              "すべて"
                                                            ]}
                                                          ]},
                  {gen1: "本・音楽・ゲーム", gen1_children: [
                                                            {gen2: "本", gen2_children[
                                                              "すべて", "文学/小説", "人文/社会", "ノンフィクション/教養", "地図/旅行ガイド", "ビジネス/経済", "健康/医学", "コンピュータ/IT", "趣味/スポーツ/実用", "住まい/暮らし/子育て", "アート/エンタメ", "洋書", "絵本", "参考書", "その他"
                                                            ]},
                                                            {gen2: "漫画", gen2_children[
                                                              "すべて", "全巻セット", "少年漫画", "少女漫画", "青年マンガ", "女性漫画", "同人誌", "その他"
                                                            ]},
                                                            {gen2: "雑誌", gen2_children[
                                                              "すべて", "アート/エンタメ/ホビー", "ファッション", "ニュース/総合", "趣味/スポーツ", "その他"
                                                            ]},
                                                            {gen2: "CD", gen2_children[
                                                              "すべて", "邦楽", "洋楽", "アニメ", "クラシック", "K-POP/アジア", "キッズ/ファミリー", "その他"
                                                            ]},
                                                            {gen2: "DVD/ブルーレイ", gen2_children[
                                                              "すべて", "外国映画", "日本映画", "アニメ", "TVドラマ", "ミュージック", "お笑い/バラエティ", "スポーツ/フィットネス", "キッズ/ファミリー", "その他"
                                                            ]},
                                                            {gen2: "レコード", gen2_children[
                                                              "すべて", "邦楽", "洋楽", "その他"
                                                            ]},
                                                            {gen2: "テレビゲーム", gen2_children[
                                                              "すべて", "家庭用ゲーム本体", "家庭用ゲームソフト", "携帯用ゲーム本体", "携帯用ゲームソフト", "PCゲーム", "その他"
                                                            ]}
                                                          ]},
            {gen1: "おもちゃ・ホビー・グッズ", gen1_children: [
                                                            {gen2: "おもちゃ", gen2_children[
                                                              "すべて", "キャラクターグッズ", "ぬいぐるみ", "小物/アクセサリー", "模型/プラモデル", "ミニカー", "トイラジコン", "プラモデル", "ホビーラジコン", "鉄道模型", "その他"
                                                            ]},
                                                            {gen2: "タレントグッズ", gen2_children[
                                                              "すべて", "アイドル", "ミュージシャン", "タレント/お笑い芸人", "スポーツ選手", "その他"
                                                            ]},
                                                            {gen2: "コミック/アニメグッズ", gen2_children[
                                                              "すべて", "ストラップ", "キーホルダー", "バッジ", "カード", "クリアファイル", "ポスター", "タオル", "その他"
                                                            ]},
                                                            {gen2: "トレーディングカード", gen2_children[
                                                              "すべて", "遊戯王", "マジック：ザ・ギャザリング", "ポケモンカードゲーム", "デュエルマスターズ", "バトルスピリッツ", "プリパラ", "アイカツ", "カードファイト!!ヴァンガード", "ヴァイスシュバルツ", "プロ野球オーナーズリーグ", "ベースボールヒーローズ", "ドラゴンボール", "スリーブ", "その他"
                                                            ]},
                                                            {gen2: "フィギュア", gen2_children[
                                                              "すべて", "コミック/アニメ", "特撮", "ゲームキャラクター", "SF/ファンタジー/ホラー", "アメコミ", "スポーツ", "ミリタリー", "その他"
                                                            ]},
                                                            {gen2: "楽器/機材", gen2_children[
                                                              "すべて", "エレキギター", "アコースティックギター", "ベース", "エフェクター", "アンプ", "弦楽器", "管楽器", "鍵盤楽器", "打楽器", "和楽器", "楽譜/スコア", "レコーディング/PA機器", "DJ機器", "DTM/DAW", "その他"
                                                            ]},
                                                            {gen2: "コレクション", gen2_children[
                                                              "すべて", "武具", "使用済切手/官製はがき", "旧貨幣/金貨/記念硬貨", "印刷物", "ノベルティグッズ", "その他"
                                                            ]},
                                                            {gen2: "ミリタリー", gen2_children[
                                                              "すべて", "トイガン", "個人装備", "その他"
                                                            ]},
                                                            {gen2: "美術品", gen2_children[
                                                              "すべて", "陶芸", "ガラス", "漆芸", "金属工芸", "絵画/タペストリ", "版画", "彫刻/オブジェクト", "書", "写真", "その他"
                                                            ]},
                                                            {gen2: "アート用品", gen2_children[
                                                              "すべて", "画材", "額縁", "その他"
                                                            ]},
                                                            {gen2: "その他", gen2_children[
                                                              "すべて", "トランプ/UNO", "カルタ/百人一首", "ダーツ", "ビリヤード", "麻雀", "パズル/ジグソーパズル", "囲碁/将棋", "オセロ/チェス", "人生ゲーム", "野球/サッカーゲーム", "スポーツ", "三輪車/乗り物", "ヨーヨー", "模型製作用品", "鉄道", "航空機", "アマチュア無線", "パチンコ/パチスロ", "その他"
                                                            ]}
                                                          ]},
                  {gen1: "コスメ・香水・美容", gen1_children:[
                                                            {gen2: "ベースメイク", gen2_children[
                                                              "すべて", "ファンデーション", "化粧下地", "コントロールカラー", "BBクリーム", "CCクリーム", "コンシーラー", "フェイスパウダー", "トライアルセット/サンプル", "その他"
                                                            ]},
                                                            {gen2: "メイクアップ", gen2_children[
                                                              "すべて", "アイシャドウ", "口紅", "リップグロス", "リップライナー", "チーク", "フェイスカラー", "マスカラ", "アイライナー", "つけまつげ", "アイブロウペンシル", "パウダーアイブロウ", "眉マスカラ", "トライアルセット/サンプル", "メイク道具/化粧小物", "美容用品/美顔ローラー", "その他"
                                                            ]},
                                                            {gen2: "ネイルケア", gen2_children[
                                                              "すべて", "ネイルカラー", "カラージェル", "ネイルベースコート/トップコート", "ネイルアート用品", "ネイルパーツ", "ネイルチップ/付け爪", "手入れ用具", "除光液", "その他"
                                                            ]},
                                                            {gen2: "香水", gen2_children[
                                                              "すべて", "香水(女性用)", "香水(男性用)", "ユニセックス", "ボディミスト", "その他"
                                                            ]},
                                                            {gen2: "スキンケア/基礎化粧品", gen2_children[
                                                              "すべて", "化粧水/ローション", "乳液/ミルク", "美容液", "フェイスクリーム", "洗顔料", "クレンジング/メイク落とし", "パック/フェイスマスク", "ジェル/ゲル", "ブースター/導入液", "アイケア", "リップケア", "トライアルセット/サンプル", "洗顔グッズ", "その他"
                                                            ]},
                                                            {gen2: "ヘアケア", gen2_children[
                                                              "すべて", "シャンプー", "トリートメント", "コンディショナー", "リンス", "スタイリング剤", "カラーリング剤", "ブラシ", "その他"
                                                            ]},
                                                            {gen2: "ボディケア", gen2_children[
                                                              "すべて", "オイル/クリーム", "ハンドクリーム", "ローション", "日焼け止め/サンオイル", "ボディソープ", "入浴剤", "制汗/デオドラント", "フットケア", "その他"
                                                            ]},
                                                            {gen2: "オーラルケア", gen2_children[
                                                              "すべて", "口臭防止/エチケット用品", "歯ブラシ", "その他"
                                                            ]},
                                                            {gen2: "リラクゼーション", gen2_children[
                                                              "すべて", "エッセンシャルオイル", "芳香機", "お香/香炉", "キャンドル", "リラクゼーショングッズ", "その他"
                                                            ]},
                                                            {gen2: "ダイエット", gen2_children[
                                                              "すべて", "ダイエット用品", "エクササイズ用品", "体重計", "体脂肪計", "その他"
                                                            ]},
                                                            {gen2: "その他", gen2_children[
                                                              "すべて", "健康用品", "看護/介護用品", "救急/衛生用品", "その他"
                                                            ]}
                                                          ]},
                {gen1: "家電・スマホ・カメラ", gen1_children:[
                                                            {gen2: "スマートフォン/携帯電話", gen2_children[
                                                              "すべて", "スマートフォン本体", "バッテリー/充電器", "携帯電話本体", "PHS本体", "その他"
                                                            ]},
                                                            {gen2: "スマホアクセサリー", gen2_children[
                                                              "すべて", "Android用ケース", "iPhone用ケース", "カバー", "イヤホンジャック", "ストラップ", "フィルム", "自撮り棒", "その他"
                                                            ]},
                                                            {gen2: "PC/タブレット", gen2_children[
                                                              "すべて", "タブレット", "ノートPC", "デスクトップ型PC", "ディスプレイ", "電子ブックリーダー", "PC周辺機器", "PCパーツ", "その他"
                                                            ]},
                                                            {gen2: "カメラ", gen2_children[
                                                              "すべて", "デジタルカメラ", "ビデオカメラ", "レンズ(単焦点)", "レンズ(ズーム)", "フィルムカメラ", "防犯カメラ", "その他"
                                                            ]},
                                                            {gen2: "テレビ/映像機器", gen2_children[
                                                              "すべて", "テレビ", "プロジェクター", "ブルーレイレコーダー", "DVDレコーダー", "ブルーレイプレーヤー", "DVDプレーヤー", "映像用ケーブル", "その他"
                                                            ]},
                                                            {gen2: "オーディオ機器", gen2_children[
                                                              "すべて", "ポータブルプレーヤー", "イヤフォン", "ヘッドフォン", "アンプ", "スピーカー", "ケーブル/シールド", "ラジオ", "その他"
                                                            ]},
                                                            {gen2: "美容/健康", gen2_children[
                                                              "すべて", "ヘアドライヤー", "ヘアアイロン", "美容機器", "電気シェーバー", "電動歯ブラシ", "その他"
                                                            ]},
                                                            {gen2: "冷暖房/空調", gen2_children[
                                                              "すべて", "エアコン", "空気清浄機", "加湿器", "扇風機", "除湿機", "ファンヒーター", "電気ヒーター", "オイルヒーター", "ストーブ", "ホットカーペット", "こたつ", "電気毛布", "その他"
                                                            ]},
                                                            {gen2: "生活家電", gen2_children[
                                                              "すべて", "冷蔵庫", "洗濯機", "炊飯器", "電子レンジ/オーブン", "調理機器", "アイロン", "掃除機", "エスプレッソマシン", "コーヒーメーカー", "衣類乾燥機", "その他"
                                                            ]},
                                                            {gen2: "その他", gen2_children[
                                                              "すべて","その他"
                                                            ]}
                                                          ]},
                  {gen1: "スポーツ・レジャー", gen1_children:[
                                                            {gen2: "ゴルフ", gen2_children[
                                                              "すべて", "クラブ", "ウェア(女性用)", "ウェア(男性用)", "バッグ", "シューズ(女性用)", "シューズ(男性用)", "アクセサリー", "その他"
                                                            ]},
                                                            {gen2: "フィッシング", gen2_children[
                                                              "すべて", "ロッド", "リール", "ルアー用品", "ウェア", "釣り糸/ライン", "その他"
                                                            ]},
                                                            {gen2: "自転車", gen2_children[
                                                              "すべて", "自転車本体", "ウェア", "パーツ", "アクセサリー", "バッグ", "工具/メンテナンス", "その他"
                                                            ]},
                                                            {gen2: "トレーニング/エクササイズ", gen2_children[
                                                              "すべて","ランニング", "ウォーキング", "ヨガ", "トレーニング用品", "その他"
                                                            ]},
                                                            {gen2: "野球", gen2_children[
                                                              "すべて","すべて", "ウェア", "シューズ", "グローブ", "バット", "アクセサリー", "防具", "練習機器", "記念グッズ", "応援グッズ", "その他"
                                                            ]},
                                                            {gen2: "サッカー/フットサル", gen2_children[
                                                              "すべて", "ウェア", "シューズ", "ボール", "アクセサリー", "記念グッズ", "応援グッズ", "その他"
                                                            ]},
                                                            {gen2: "テニス", gen2_children[
                                                              "すべて", "ラケット(硬式用)", "ラケット(軟式用)", "ウェア", "シューズ", "ボール", "アクセサリー", "記念グッズ", "応援グッズ", "その他"
                                                            ]},
                                                            {gen2: "スノーボード", gen2_children[
                                                              "すべて", "ボード", "バインディング", "ブーツ(男性用)", "ブーツ(女性用)", "ブーツ(子ども用)", "ウェア/装備(男性用)", "ウェア/装備(女性用)", "ウェア/装備(子ども用)", "アクセサリー", "バッグ", "その他"
                                                            ]},
                                                            {gen2: "スキー", gen2_children[
                                                              "すべて", "板", "ブーツ(男性用)", "ブーツ(女性用)", "ブーツ(子供用)", "ビンディング", "ウェア(男性用)", "ウェア(女性用)", "ウェア(子ども用)", "ストック", "その他"
                                                            ]},
                                                            {gen2: "その他スポーツ", gen2_children[
                                                              "すべて", "ダンス/バレエ", "サーフィン", "バスケットボール", "バドミントン", "バレーボール", "スケートボード", "陸上競技", "ラグビー", "アメリカンフットボール", "ボクシング", "ボウリング", "その他"
                                                            ]},
                                                            {gen2: "アウトドア", gen2_children[
                                                              "すべて", "テント/タープ", "ライト/ランタン", "寝袋/寝具", "テーブル/チェア", "ストーブ/コンロ", "調理器具", "食器", "登山用品", "その他"
                                                            ]},
                                                            {gen2: "その他", gen2_children[
                                                              "すべて", "旅行用品", "その他"
                                                            ]}
                                                          ]},
                      {gen1: "ハンドメイド", gen1_children: [
                                                            {gen2: "アクセサリー(女性用)", gen2_children[
                                                              "すべて", "ピアス", "イヤリング", "ネックレス", "ブレスレット", "リング", "チャーム", "ヘアゴム", "アンクレット", "その他"
                                                            ]},
                                                            {gen2: "ファッション/小物", gen2_children[
                                                              "すべて", "バッグ(女性用)", "バッグ(男性用)", "財布(女性用)", "財布(男性用)", "ファッション雑誌", "その他"
                                                            ]},
                                                            {gen2: "アクセサリー/時計", gen2_children[
                                                              "すべて", "アクセサリー(男性用)", "時計(女性用)", "時計(男性用)", "その他"
                                                            ]},
                                                            {gen2: "日用品/インテリア", gen2_children[
                                                              "すべて", "キッチン用品", "家具", "文房具", "アート/写真", "アロマ/キャンドル", "フラワー/ガーデン", "その他"
                                                            ]},
                                                            {gen2: "趣味/おもちゃ", gen2_children[
                                                              "すべて", "クラフト/布製品", "おもちゃ/人形", "その他"
                                                            ]},
                                                            {gen2: "キッズ/ベビー", gen2_children[
                                                              "すべて", "ファッション雑貨", "スタイ/よだれがけ", "外出用品", "ネームタグ", "その他"
                                                            ]},
                                                            {gen2: "素材/材料", gen2_children[
                                                              "すべて", "各種パーツ", "生地/糸", "型紙/パターン", "その他"
                                                            ]},
                                                            {gen2: "二次創作物", gen2_children[
                                                              "すべて","Ingress", "クリエイターズ宇宙兄弟"
                                                            ]},
                                                            {gen2: "その他", gen2_children[
                                                              "すべて"
                                                            ]}
                                                          ]},
                          {gen1: "チケット", gen1_children:[
                                                            {gen2: "音楽", gen2_children[
                                                              "すべて", "男性アイドル", "女性アイドル", "韓流", "国内アーティスト", "海外アーティスト", "音楽フェス", "声優/アニメ", "その他"
                                                            ]},
                                                            {gen2: "スポーツ", gen2_children[
                                                              "すべて", "サッカー", "野球", "テニス", "格闘技/プロレス", "相撲/武道", "ゴルフ", "バレーボール", "バスケットボール", "モータースポーツ", "ウィンタースポーツ", "その他"
                                                            ]},
                                                            {gen2: "演劇/芸能", gen2_children[
                                                              "すべて", "ミュージカル", "演劇", "伝統芸能", "落語", "お笑い", "オペラ", "サーカス", "バレエ", "その他"
                                                            ]},
                                                            {gen2: "イベント", gen2_children[
                                                              "すべて", "声優/アニメ", "キッズ/ファミリー", "トークショー/講演会", "その他"
                                                            ]},
                                                            {gen2: "映画", gen2_children[
                                                              "すべて", "邦画", "洋画", "その他"
                                                            ]},
                                                            {gen2: "施設利用券", gen2_children[
                                                              "すべて", "遊園地/テーマパーク", "美術館/博物館", "スキー場", "ゴルフ場", "フィットネスクラブ", "プール", "ボウリング場", "水族館", "動物園", "その他"
                                                            ]},
                                                            {gen2: "優待券/割引券", gen2_children[
                                                              "すべて", "ショッピング", "レストラン/食事券", "フード/ドリンク券", "宿泊券", "その他"
                                                            ]},
                                                            {gen2: "その他", gen2_children[
                                                              "すべて"
                                                            ]}
                                                          ]},
                  {gen1: "自動車・オートバイ", gen1_children:[
                                                            {gen2: "自動車本体", gen2_children[
                                                              "すべて", "国内自動車本体", "外国自動車本体"
                                                            ]},
                                                            {gen2: "自動車タイヤ/ホイール", gen2_children[
                                                              "すべて", "タイヤ/ホイールセット", "タイヤ", "ホイール", "その他"
                                                            ]},
                                                            {gen2: "自動車パーツ", gen2_children[
                                                              "すべて", "サスペンション", "ブレーキ", "外装、エアロパーツ", "ライト", "内装品、シート", "ステアリング", "マフラー・排気系", "エンジン、過給器、冷却装置", "クラッチ、ミッション、駆動系", "電装品", "補強パーツ", "汎用パーツ", "外国自動車用パーツ", "その他"
                                                            ]},
                                                            {gen2: "自動車アクセサリー", gen2_children[
                                                              "すべて", "車内アクセサリー", "カーナビ", "カーオーディオ", "車外アクセサリー", "メンテナンス用品", "チャイルドシート", "ドライブレコード", "レーダー探知機", "カタログ/マニュアル", "セキュリティ", "ETC", "その他"
                                                            ]},
                                                            {gen2: "オートバイ車体", gen2_children[
                                                              "すべて"
                                                            ]},
                                                            {gen2: "オートバイパーツ", gen2_children[
                                                              "すべて", "タイヤ", "マフラー", "エンジン、冷却装置", "カウル、フェンダー、外装", "サスペンション", "ホイール", "シート", "ブレーキ", "タンク", "ライト、ウィンカー", "チェーン、スプロケット、駆動系", "メーター", "電装系", "ミラー", "外国オートバイ用パーツ", "その他"
                                                            ]},
                                                            {gen2: "オートバイアクセサリー", gen2_children[
                                                              "すべて", "ヘルメット/シールド", "バイクウェア/装備", "アクセサリー", "メンテナンス", "カタログ/マニュアル", "その他"
                                                            ]}
                                                          ]},
                            {gen1: "その他", gen1_children:[
                                                            {gen2: "まとめ売り", gen2_children[
                                                              "すべて"
                                                            ]},
                                                            {gen2: "ペット用品", gen2_children[
                                                              "すべて","ペットフード", "犬用品", "猫用品", "魚用品/水草", "小動物用品", "爬虫類/両生類用品", "かご/おり", "鳥用品", "虫類用品", "その他"
                                                            ]},
                                                            {gen2: "食品", gen2_children[
                                                              "すべて", "菓子", "米", "野菜", "果物", "調味料", "魚介類(加工食品)", "肉類(加工食品)", "その他 加工食品", "その他"
                                                            ]},
                                                            {gen2: "飲料/酒", gen2_children[
                                                              "すべて", "コーヒー", "ソフトドリンク", "ミネラルウォーター", "茶", "ウィスキー", "ワイン", "ブランデー", "焼酎", "日本酒", "ビール、発泡酒", "その他"
                                                            ]},
                                                            {gen2: "日用品/生活雑貨/旅行", gen2_children[
                                                              "すべて", "タオル/バス用品", "日用品/生活雑貨", "洗剤/柔軟剤", "旅行用品", "防災関連グッズ", "その他"
                                                            ]},
                                                            {gen2: "アンティーク/コレクション", gen2_children[
                                                              "すべて", "雑貨", "工芸品", "家具", "印刷物", "その他"
                                                            ]},
                                                            {gen2: "文房具/事務用品", gen2_children[
                                                              "すべて", "筆記具", "ノート/メモ帳", "テープ/マスキングテープ", "カレンダー/スケジュール", "アルバム/スクラップ", "ファイル/バインダー", "はさみ/カッター", "カードホルダー/名刺管理", "のり/ホッチキス", "その他"
                                                            ]},
                                                            {gen2: "事務/店舗用品", gen2_children[
                                                              "すべて", "オフィス用品一般", "オフィス家具", "店舗用品", "OA機器", "ラッピング/包装", "その他"
                                                            ]},
                                                            {gen2: "その他", gen2_children[
                                                              "すべて"
                                                            ]}
                                                          ]}
]

# Categoryクラスのインスタンスを生成
@category1 = Category.create(name: "レディース")
# 配列を定義。中身は[{子カテゴリ, 孫カテゴリー群}]という構成。
category1s = [{gen2: "トップス", gen3:["Tシャツ/カットソー(半袖/袖なし)", "Tシャツ/カットソー(七分/長袖)", "シャツ/ブラウス(半袖/袖なし)", "シャツ/ブラウス(七分/長袖)", "ポロシャツ", "キャミソール", "タンクトップ", "ホルターネック", "ニット/セーター", "チュニック", "カーディガン/ボレロ", "アンサンブル", "ベスト/ジレ", "パーカー", "トレーナー/スウェット", "ベアトップ/チューブトップ", "ジャージ", "その他"]}]
            #  "ジャケット/アウター", "パンツ", "スカート", "ワンピース", "靴", "ルームウェア/パジャマ", "レッグウェア", "帽子", "バッグ", "アクセサリー", "ヘアアクセサリー", "小物", "時計"

# １を添字の始まりに指定し、配列に対し繰り返し処理を行う。
category1s.each.with_index(1) do [category1, i]
  gen2_var = "@category1_#{i}"
  # 小カテゴリーを自動生成
  gen2_val = @category1.children.create(name:"#{category1[:gen2]}")
  eval("#{gen2_var} = gen2_val")
  category1[:gen3].each do |gen3_val|
    eval("#{gen2_var}".children.create(name:gen3_val))
  end
end